package hw01;

public class Task1 {
    public static void main(String[] args) {

        // Задание 1
        //Даны длина, ширина прямоугольника.
        // Найти и вывести в консоль его площадь

        int length = 34, width = 56 ;
        System.out.println(length * width);



    }
}
