package hw01;

public class Task3 {
    public static void main(String[] args) {
        // Задание 3
        // Даны две переменные типа double:
        // время (в часах) и расстояние (в километрах).
        // Найти и вывести в консоль скорость,
        // выраженную в метрах в секунду.

        double time = 3.5;
        double distance = 563;

        System.out.println((distance / time) / 3.6);

    }
}
